Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Usenet News group where Vim is discussed: *news* *usenet* comp.editors This group is also for other editors.
es_es: Grupo de Usenet News en el que se trata Vim: *news* *usenet* comp.editors Este grupo también trata de otros editores.

source: If you write about Vim, don't forget to mention that.
es_es: Si escribe sobre Vim, no olvide de mencionar esto último.

source: *mail-list* *maillist* There are several mailing lists for Vim: <vim@vim.org> For discussions about using existing versions of Vim: Useful mappings, questions, answers, where to get a specific version, etc.
es_es: *mail-list* *maillist* Existen varias listas de correo acerca de Vim: <vim@vim.org> Para discusiones acerca del uso de varias versiones de Vim: Macros útiles, preguntas, respuestas, dónde obtener una versión especifica.

source: There are quite a few people watching this list and answering questions, also for beginners.
es_es: Hay varias personas mirando esta lista, y que responden a preguntas, también para principiantes.

source: Don't hesitate to ask your question here.
es_es: No dude en preguntar.

source: <vim-dev@vim.org> *vim-dev* *vimdev* For discussions about changing Vim: New features, porting, patches, beta-test versions, etc.
es_es: <vim-dev@vim.org> *vim-dev* *vimdev* Para la discusión de cambios en Vim: Nuevas características, portabilidad, parches, versiones beta, etc.

source: <vim-announce@vim.org> *vim-announce* Announcements about new versions of Vim; also for beta-test versions and ports to different systems.
es_es: <vim-announce@vim.org> *vim-announce* Anuncios acerca de nuevas versiones de Vim; también para versiones beta y la adaptación a otras arquitecturas.

source: This is a read-only list.
es_es: Lista de sólo lectura.

source: <vim-multibyte@vim.org> *vim-multibyte* For discussions about using and improving the multi-byte aspects of Vim.
es_es: <vim-multibyte@vim.org> *vim-multibyte* Discusión acerca de la mejora de la experiencia multi-byte en Vim.

source: <vim-mac@vim.org> *vim-mac* For discussions about using and improving the Macintosh version of Vim.
es_es: <vim-mac@vim.org> *vim-mac* Discusión acerca del uso y la mejora de la versión Macintosh de Vim.

source: NOTE: - You can only send messages to these lists if you have subscribed!
es_es: NOTA: - Sólo puede mandar mensajes a estas listas si esta suscrito.

source: - You need to send the messages from the same location as where you subscribed from (to avoid spam mail).
es_es: - Debe mandar los mensajes desde la misma dirección desde la cual se suscribió (para evitar el spam).

source: - Maximum message size is 40000 characters.
es_es: - El tamaño máximo de un mensaje es de 40000 caracteres.

source: *subscribe-maillist* If you want to join, send a message to <vim-subscribe@vim.org> Make sure that your "From:" address is correct.
es_es: *lista-correo* *subscribe-maillist* Si desea unirse, envie un mensaje a <vim-subscribe@vim.org> Asegúrese de que su dirección «De:» es correcta.

source: Then the list server will give you help on how to subscribe.
es_es: El servidor de la lista le asistirá para suscribirse.

source: It will help to include information about the version of Vim you are using and your setup.
es_es: Nos ayudaría si incluye información acerca de su configuración y versión de Vim.

source: You can get the information with this command: > :so $VIMRUNTIME/bugreport.vim This will create a file "bugreport.txt" in the current directory, with a lot of information of your environment.
es_es: Puede obtener esta información con la siguiente orden: > :so $VIMRUNTIME/bugreport.vim Esto creará el archivo «bugreport.txt» en el directorio presente, conteniendo información relativa a su entorno.

source: Before sending this out, check if it doesn't contain any confidential information!
es_es: Antes de enviarlo, revise que no contenga ninguna información confidencial.

source: If Vim crashes, please try to find out where.
es_es: Si Vim se cuelga, intente encontrar donde.

source: You can find help on this here: |debug.txt|.
es_es: Puede encontrar ayuda aquí: |debug.txt|.

source: There might be a year 2038 problem, when the seconds don't fit in a 32 bit int anymore.
es_es: Puede aparecer un problema en el año 2038, cuando los segundos no quepan en 32 bits.

source: This depends on the compiler, libraries and operating system.
es_es: Esto depende del compilador, la bibliotecas y el sistema operativo.

source: Specifically, time_t and the ctime() function are used.
es_es: Se usan particularmente las funciones «time_t» y «ctime()».

source: And the time_t is stored in four bytes in the swap file.
es_es: «time_t» se guarda en cuatro bytes en el archivo de intercambio.

source: But that's only used for printing a file date/time for recovery, it will never affect normal editing.
es_es: Esto último sólo se emplea para imprimir una fecha/tiempo para la recuperación y en ningún caso afectará a la edición normal.

source: The Vim strftime() function directly uses the strftime() system function.
es_es: La función de Vim «strftime()» usa directamente la función del sistema «strftime()».

source: localtime() uses the time() system function.
es_es: «localtime()» usa la función del sistema «time()».

source: getftime() uses the time returned by the stat() system function.
es_es: «getftime» usa el tiempo devuelto por la función del sistema «stat()».

source: If your system libraries are year 2000 compliant, Vim is too.
es_es: Si las bibliotecas de sus sistema son compatibles con el año 2000, Vim también lo es.

source: The user may create scripts for Vim that use external commands.
es_es: El usuario puede crear scripts para Vim que usan órdenes externas.

source: These might introduce Y2K problems, but those are not really part of Vim itself.
es_es: Esto puede introducir problemas Y2K, pero no son parte de Vim.

source: Credits *credits* *author* *Bram* *Moolenaar*
es_es: Creditos *credits* *créditos* *autor* *Bram* *Moolenaar*

source: Parts of the documentation come from several Vi manuals, written by: W.N.
es_es: El origen de algunas partes de la documentación nacen de varios manuales de Vim, escritos por: W.N.

source: The Vim editor is based on Stevie and includes (ideas from) other software, worked on by the people mentioned here.
es_es: El editor Vim está basado en Stevie, e incluye ideas procedentes de otro software, trabajadas por la gente aquí mencionada.

source: Other people helped by sending me patches, suggestions and giving feedback about what is good and bad in Vim.
es_es: Otra gente me ayudó mediante parches, sugerencias y opiniones acerca de lo bueno y malo de Vim.

source: I wish to thank all the people that sent me bug reports and suggestions.
es_es: Quisiera dar gracias a toda la gente que envió informes de fallo y sugerencias.

source: The list is too long to mention them all here.
es_es: La lista es demasiado larga como para mencionarlos a todos aquí.

source: Vim would not be the same without the ideas from all these people: They keep Vim alive!
es_es: Vim no sería lo mismo sin las ideas de todas esta gente: ¡Mantienen Vim vivo!

source: In this documentation there are several references to other versions of Vi: *Vi* *vi* Vi "the original".
es_es: A lo largo de la documentación verá varias referencias a otras versiones de Vi: *Vi* *vi* Vi «El original».

source: Without further remarks this is the version of Vi that appeared in Sun OS 4.x.
es_es: Sin mas detalle, esta es la versión de Vim que apareció en Sun Os 4.x.

source: ":version" returns "Version 3.7, 6/7/85".
es_es: «:version» devuelve «Version 3.7, 6/7/85».

source: Sometimes other versions are referred to.
es_es: A veces encontrara referencias a otras versiones.

source: Only runs under Unix.
es_es: Sólo funciona bajo Unix.

source: Source code only available with a license.
es_es: El código sólo está disponible a través de una licencia.

source: More information on Vi can be found through: http://vi-editor.org [doesn't currently work...] *Posix* Posix From the IEEE standard 1003.2, Part 2: Shell and utilities.
es_es: Puede encontrar más información a cerca de Vi: http://vi-editor.org (no funciona a día de hoy...) *Posix* Posix Pertenece al estándar IEEE 1003.2.

source: Generally known as "Posix".
es_es: Parte 2: Consola y utilidades.

source: This is a textual description of how Vi is supposed to work.
es_es: Generalmente conocido como «Posix», una descripción textual de cómo debe funcionar Vi.

source: See |posix-compliance|.
es_es: Véase |posix-compliance|.

source: *Nvi* Nvi The "New" Vi.
es_es: *Nvi* Nvi El «Nuevo» Vi.

source: The version of Vi that comes with BSD 4.4 and FreeBSD.
es_es: La versión de Vi que ofrece BSD 4.4 y FreeBSD.

source: Very good compatibility with the original Vi, with a few extensions.
es_es: Es muy compatible con el editor original Vi, con unas cuantas extensiones.

source: The version used is 1.79.
es_es: La versión referida es 1.79.

source: ":version" returns "Version 1.79 (10/23/96)".
es_es: «:version» devuelve «Version 1.79 (10/23/96).

source: There has been no release the last few years, although there is a development version 1.81.
es_es: No se ha publicado una nueva versión en los últimos años, aunque existe una versión en desarrollo 1.81.

source: Source code is freely available.
es_es: El código se distribuye libremente.

source: *Elvis* Elvis Another Vi clone, made by Steve Kirkendall.
es_es: *Elvis* Elvis Otro clon de Vi, hecho por Steve Kirkendall.

source: Very compact but isn't as flexible as Vim.
es_es: Muy compacto pero menos flexible que Vim.

source: The version used is 2.1.
es_es: La versión referida es 2.1.

source: It is still being developed.
es_es: Aún está en desarrollo.

source: Notation *notation*
es_es: Notación *notación* *leyenda*

source: When syntax highlighting is used to read this, text that is not typed literally is often highlighted with the Special group.
es_es: Si usa el resaltado de sintaxis para leer esto, el texto que no se ha introducido literalmente será resaltado como perteneciente al grupo Special.

source: These are items in [], {} and <>, and CTRL-X.
es_es: Estos son los elementos [], {}, <> y CTRL-X.

source: Note that Vim uses all possible characters in commands.
es_es: Tenga en cuenta que Vim utiliza todos los caracteres posibles en las órdenes.

source: Sometimes the [], {} and <> are part of what you type, the context should make this clear.
es_es: El contexto aclarará cuando los signos [], () y <> son parte de texto literal.

source: *count* *[count]* *E489* [count] An optional number that may precede the command to multiply or iterate the command.
es_es: *[número]* *[count]* *E489* Un número opcional que puede preceder a la orden para multiplicar o cambiar la orden.

source: If no number is given, a count of one is used, unless otherwise noted.
es_es: Si no introduce un número, se usará uno a menos que se indique lo contrario.

source: Note that in this manual the [count] is not mentioned in the description of the command, but only in the explanation.
es_es: Tenga en cuenta] que en este manual, el [número no se menciona en las descripciones de las órdenes.

source: This was done to make the commands easier to look up.
es_es: La razón para esto es facilitar la lectura de las órdenes.

source: If the 'showcmd' option is on, the (partially) entered count is shown at the bottom of the window.
es_es: Si la opción esta activada, el número (parcialmente) introducido se mostrará en la parte inferior de la ventana.

source: You can use <Del> to erase the last digit (|N<Del>|).
es_es: Puede usar <Supr> para eliminar el último dígito (|N<Supr>|).

source: *[quotex]* ["x] An optional register designation where text can be stored.
es_es: *quotex* ["x] Un destino opcional para un registro dónde guardar el texto.

source: See |registers|.
es_es: Consulte |registers|.

source: The x is a single character between 'a' and 'z' or 'A' and 'Z' or '"', and in some cases (with the put command) between '0' and '9', '%', '#', or others.
es_es: La x es un único carácter entre 'a' y 'z', o 'A' y 'Z' o '"', y en algunos casos (con la orden «put») entre '0' y '9', '%', '#', u otros.

source: The uppercase and lowercase letter designate the same register, but the lowercase letter is used to overwrite the previous register contents, while the uppercase letter is used to append to the previous register contents.
es_es: Las mayúsculas y y minúsculas designan el mismo registro, pero la minúscula se usa para eliminar los contenidos anteriores del registro, y la mayúscula para añadir contenido.

source: Without the ""x" or with """" the stored text is put into the unnamed register.
es_es: El texto se almacenará en un registro sin nombre en caso de no usar «"x» o «""».

source: *{}* {} Curly braces denote parts of the command which must appear, but which can take a number of different values.
es_es: *{}* {} Las llaves indican qué partes de una orden son obligatorios, pero que pueden tomar distintos valores.

source: The differences between Vim and Vi are also given in curly braces (this will be clear from the context).
es_es: Las diferencias entre Vim y Vi también se resaltan con llaves (el contexto aclarará esto).

source: *{char1-char2}* {char1-char2} A single character from the range char1 to char2.
es_es: *{car1-car2}* {car1-car2} Un único carácter entre el rango car1 y car2.

source: For example: {a-z} is a lowercase letter.
es_es: Por ejemplo: {a-z} simboliza un carácter en minúscula.

source: Multiple ranges may be concatenated.
es_es: Puede encadenar varios rangos.

source: For example, {a-zA-Z0-9} is any alphanumeric character.
es_es: Por ejemplo, {a,zA-Z0-9} es cualquier carácter alfanumérico.

source: *'option'* 'option' An option, or parameter, that can be set to a value, is enclosed in single quotes.
es_es: *'option'* 'opción' Una opción o parámetro que puede definir con un valor aparecerá entre comillas simples.

source: See |options|.
es_es: Consulte |options|.

source: *key-notation* *key-codes* *keycodes* These names for keys are used in the documentation.
es_es: *notación-teclas* *teclas-tabla* *leyendatabla* Éstos son los nombres de las teclas en la documentación.

source: They can also be used with the ":map" command (insert the key name by pressing CTRL-K and then the key you want the name for).
es_es: También puede usarlos con la orden «:map» (inserte el nombre de la tecla pulsando CTRL-K y la tecla cuyo nombre desea).

source: Note: The shifted cursor keys, the help key, and the undo key are only available on a few terminals.
es_es: Nota: Las teclas de movimiento, la tecla de ayuda y la tecla deshacer combinados con la tecla shift sólo están disponibles en algunas terminales.

source: On the Amiga, shifted function key 10 produces a code (CSI) that is also used by key sequences.
es_es: En Amiga, la tecla función 10 con shift produce un código (CSI) también empleado en secuencias de teclas.

source: It will be recognized only after typing another key.
es_es: Sólo se reconocerá tras pulsar otra tecla.

source: Note: There are two codes for the delete key.
es_es: Nota: Hay dos códigos para la tecla suprimir.

source: 127 is the decimal ASCII value for the delete key, which is always recognized.
es_es: El valor decimal ASCII de la tecla suprime es 127, éste siempre se reconocerá.

source: Some delete keys send another value, in which case this value is obtained from the termcap entry "kD".
es_es: Algunas teclas suprimir envían otro valor, en cuyo caso el valor se obtiene de la entrada de termcap «kD».

source: Both values have the same effect.
es_es: Ambos valores tienen el mismo efecto.

source: Also see |:fixdel|.
es_es: Véase también |:fixdel|.

source: Note: The keypad keys are used in the same way as the corresponding "normal" keys.
es_es: Nota: El uso de las teclas del teclado numérico es idéntico a sus teclas «normales» correspondientes.

source: For example, <kHome> has the same effect as <Home>.
es_es: Por ejemplo, <kHome> tiene el mismo efecto que <Home>.

source: If a keypad key sends the same raw key code as its non-keypad equivalent, it will be recognized as the non-keypad code.
es_es: Si una tecla del bloque envía el mismo código que su equivalente externo al bloque numérico, será reconocido como un código que no pertenece al bloque.

source: For example, when <kHome> sends the same code as <Home>, when pressing <kHome> Vim will think <Home> was pressed.
es_es: Por ejemplo, cuando <kHome> envía el mismo código que <Home>, Vim creerá que pulsa <Home> cuando en realidad pulsa <kHome>.

source: Mapping <kHome> will not work then.
es_es: De ser así, las macros con <kHome> no funcionarán.

source: Examples for mapping CTRL-H to the six characters "<Home>": > :imap <C-H> \<Home> :imap <C-H> <lt>Home> The first one only works when the 'B' flag is not in 'cpoptions'.
es_es: Ejemplos para asignar CTRL-H a los seis caracteres «<Home>»: > :imap <C-H> \<Home> :imap <C-H> <lt>Home> El primero sólo funciona si la opción 'B' no está en 'cpoptions'.

source: The second one always works.
es_es: El segundo siempre funciona.

source: To get a literal "<lt>" in a mapping: > :map <C-L> <lt>lt>
es_es: Para obtener un <lt> en una macro: > :map <C-L> <lt>lt>

source: For mapping, abbreviation and menu commands you can then copy-paste the examples and use them directly.
es_es: Puede copiar y pegar los ejemplos directamente para las macros, abreviaturas y órdenes de menú.

source: Or type them literally, including the '<' and '>' characters.
es_es: O también introducirlos literalmente, incluyendo los caracteres «<» y «>».

source: This does NOT work for other commands, like ":set" and ":autocmd"!
es_es: ¡Esto NO funciona con otras órdenes, como «:set» y «:autocmd».!

source: Modes, introduction *vim-modes-intro* *vim-modes*
es_es: Introducción a los modos *modos-vim* *vim-modes-intro* *vim-modes*

source: Visual mode This is like Normal mode, but the movement commands extend a highlighted area.
es_es: Modo Visual Es similar al modo Normal, pero las órdenes de movimiento extienden un área resaltada.

source: When a non-movement command is used, it is executed for the highlighted area.
es_es: Cuando use una orden que no sea de moción, éste afectará a toda el área resaltada.

source: See |Visual-mode|.
es_es: Consulte |Visual-mode|.

source: If the 'showmode' option is on "-- VISUAL --" is shown at the bottom of the window.
es_es: Si la opción 'showmode' está activada, verá «-- VISUAL --» en la parte inferior de la ventana.

source: Select mode This looks most like the MS-Windows selection mode.
es_es: Modo seleccionar Similar al modo de selección de MS-Windows.

source: Typing a printable character deletes the selection and starts Insert mode.
es_es: Teclear un carácter imprimible elimina la selección e inicia el modo Insertar.

source: See |Select-mode|.
es_es: Consulte |Select-mode|.

source: If the 'showmode' option is on "-- SELECT --" is shown at the bottom of the window.
es_es: Si la opción 'showmode' esta activada, verá «-- SELECT --» en la parte inferior de la ventana.

source: Insert mode In Insert mode the text you type is inserted into the buffer.
es_es: Modo Insertar En el modo Insertar, el texto que teclee aparecerá en el búfer.

source: See |Insert-mode|.
es_es: Consulte |Insert-mode|.

source: If the 'showmode' option is on "-- INSERT --" is shown at the bottom of the window.
es_es: Si la opción 'showmode' esta activada, verá «-- INSERT --» en la parte inferior de la ventana.

source: Command-line mode In Command-line mode (also called Cmdline mode) you Cmdline mode can enter one line of text at the bottom of the window.
es_es: Modo Línea de órdenes En este modo (también llamado «Cmdline mode») Cmdline mode puede introducir una línea de texto en la parte inferior de la ventana.

source: This is for the Ex commands, ":", the pattern search commands, "?" and "/", and the filter command, "!".
es_es: Ésto es para las órdenes Ex, «:», las órdenes de búsqueda de patrón, «?» y «/», y la orden de filtrado, «!».

source: Ex mode Like Command-line mode, but after entering a command you remain in Ex mode.
es_es: Modo Ex Es similar al modo Línea de órdenes, pero permanecerá en modo Ex después de ejecutar la orden.

source: Very limited editing of the command line.
es_es: Ofrece una edición limitada de la línea de órdenes.

source: Replace mode Replace mode is a special case of Insert mode.
es_es: Modo Reemplazar El modo Reemplazar es un tipo especial del modo Insertar.

source: You can do the same things as in Insert mode, but for each character you enter, one character of the existing text is deleted.
es_es: Puede hacer las mismas cosas que en el modo Insertar, pero sustituirá un carácter existente por cada carácter que inserte.

source: See |Replace-mode|.
es_es: Consulte |Replace-mode|.

source: If the 'showmode' option is on "-- REPLACE --" is shown at the bottom of the window.
es_es: Si la opción 'showmode' está activada, verá «-- REPLACE --» en la base de la ventana.

source: Virtual Replace mode Virtual Replace mode is similar to Replace mode, but instead of file characters you are replacing screen real estate.
es_es: Modo Reemplazar Virtual El modo Reemplazar Virtual es similar al modo Reemplazar, pero en lugar de reemplazar caracteres, reemplaza el estado real de la pantalla.

source: See |Virtual-Replace-mode|.
es_es: Consulte |Virtual-Replace-mode|.

source: If the 'showmode' option is on "-- VREPLACE --" is shown at the bottom of the window.
es_es: Si la opción 'showmode' está activada, verá «-- VREPLACE --» en la base de la ventana.

source: Insert Select mode Entered when starting Select mode from Insert mode.
es_es: Modo Seleccionar Se inicia al ejecutar el modo Seleccionar a partir de inserción del modo Insertar.

source: E.g., by dragging the mouse or <S-Right>.
es_es: Por ejemplo, arrastrando el ratón o <S-Derecha>.

source: When the Select mode ends, Vim returns to Insert mode.
es_es: Vim le devolverá al modo Insertar al finalizar el modo Seleccionar.

source: If the 'showmode' option is on "-- (insert) SELECT --" is shown at the bottom of the window.
es_es: Si la opción 'showmode' está activada, verá «-- (insert) SELECT --» en la base de la ventana.

source: Switching from mode to mode *mode-switching*
es_es: Cambiar de modo *cambiar-modo* *mode-switching*

source: *i_esc* TO mode ~ Normal Visual Select Insert Replace Cmd-line Ex ~ FROM mode ~ Normal v V ^V *4 *1 R gR : / ?
es_es: *i_esc* DESDE el modo ~ Normal Visual Selección Insertar Reemplazar Línea Ex ~ de órdenes A el modo ~ Normal v V ^V *4 *1¿ R gR : / ?

source: Q Visual *2 ^G c C -- : -- Select *5 ^O ^G *6 -- -- -- Insert <Esc> -- -- <Insert> -- -- Replace <Esc> -- -- <Insert> -- -- Command-line *3 -- -- :start -- -- Ex :vi -- -- -- -- --
es_es: Q Visual *2 ^G c C -- : -- Seleccionar *5 ^O ^G *6 -- -- -- Insertar <Esc> -- -- <Insertar> -- -- Reemplazar <Esc> -- -- <Insertar> -- -- Línea de órdenes *3 -- -- :start -- -- Ex :vi -- -- -- -- --

source: *CTRL-\_CTRL-N* *i_CTRL-\_CTRL-N* *c_CTRL-\_CTRL-N* *v_CTRL-\_CTRL-N* Additionally the command CTRL-\ CTRL-N or <C-\><C-N> can be used to go to Normal mode from any other mode.
es_es: *CTRL-\_CTRL-N* *i_CTRL-\_CTRL-N* *c_CTRL-\_CTRL-N* *v_CTRL-\_CTRL-N* De forma adicional, puede usar CTRL-\ CTRL-N o <C-\><C-N> para pasar al modo Normal a partir de cualquier otro.

source: This can be used to make sure Vim is in Normal mode, without causing a beep like <Esc> would.
es_es: Puede usar esto para asegurarse de que Vim está en modo Normal, sin causar el pitido que <Esc> realiza.

source: However, this does not work in Ex mode.
es_es: Por otra parte, esto no funciona en modo Ex.
